// Сгенерируйте случайное число от 0 до 100 включительно.

// console.log(Math.floor(Math.random() * 101));

// Сгенерируйте случайное число от 50 до 100 вк
 
// console.log(Math.ceil(Math.random() * 50) + 50);

// Сгенерируйте случайное число от 0 до 255 включительно.

// console.log(Math.floor(Math.random() * 256));

// Рассчитайте общий годовой доход человека, извлекя цифры из следующего текста. «Он зарабатывает 5000 евро от зарплаты в месяц, 10000 евро годовой премии, 15000 евро онлайн-курсов в месяц».

console.log(`Общий годовой доход человека: ${5000 * 12 + 10000 + 12 * 15000}`)